OppositeDirectionFlow/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2406                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// ************************************************************************* //
// Full 3D concentric heat exchanger, axis along x
//
// Length                    : 0.75 m  (-0.375 <= x <= 0.375)
// Oil (region1)             : 0      < r < 0.050 m
// Solid pipe wall (pipeWall): 0.050  < r < 0.052 m
// Water (region2)           : 0.052  < r < 0.100 m
//
// Mesh topology: square core + four O-grid sectors in each radial layer.
// The square half-width (0.025 m) is a mesh-topology parameter only.
//
// Approximate mesh size with the counts below: 806,400 cells.

convertToMeters 1;

vertices
(
    // -----------------------------------------------------------------
    // x = -0.375 m plane
    // -----------------------------------------------------------------

    // Central square, half-width = 0.025 m
    ( -0.375   0.02500000000   0.02500000000 ) // 0  C0 NE
    ( -0.375  -0.02500000000   0.02500000000 ) // 1  C1 NW
    ( -0.375  -0.02500000000  -0.02500000000 ) // 2  C2 SW
    ( -0.375   0.02500000000  -0.02500000000 ) // 3  C3 SE

    // Oil / solid interface, r = 0.050 m
    ( -0.375   0.03535533906   0.03535533906 ) // 4  A0 NE
    ( -0.375  -0.03535533906   0.03535533906 ) // 5  A1 NW
    ( -0.375  -0.03535533906  -0.03535533906 ) // 6  A2 SW
    ( -0.375   0.03535533906  -0.03535533906 ) // 7  A3 SE

    // Solid / water interface, r = 0.052 m
    ( -0.375   0.03676955262   0.03676955262 ) // 8  B0 NE
    ( -0.375  -0.03676955262   0.03676955262 ) // 9  B1 NW
    ( -0.375  -0.03676955262  -0.03676955262 ) // 10 B2 SW
    ( -0.375   0.03676955262  -0.03676955262 ) // 11 B3 SE

    // Outer water radius, r = 0.100 m
    ( -0.375   0.07071067812   0.07071067812 ) // 12 D0 NE
    ( -0.375  -0.07071067812   0.07071067812 ) // 13 D1 NW
    ( -0.375  -0.07071067812  -0.07071067812 ) // 14 D2 SW
    ( -0.375   0.07071067812  -0.07071067812 ) // 15 D3 SE


    // -----------------------------------------------------------------
    // x = +0.375 m plane
    // -----------------------------------------------------------------

    // Central square
    (  0.375   0.02500000000   0.02500000000 ) // 16 C0 NE
    (  0.375  -0.02500000000   0.02500000000 ) // 17 C1 NW
    (  0.375  -0.02500000000  -0.02500000000 ) // 18 C2 SW
    (  0.375   0.02500000000  -0.02500000000 ) // 19 C3 SE

    // Oil / solid interface, r = 0.050 m
    (  0.375   0.03535533906   0.03535533906 ) // 20 A0 NE
    (  0.375  -0.03535533906   0.03535533906 ) // 21 A1 NW
    (  0.375  -0.03535533906  -0.03535533906 ) // 22 A2 SW
    (  0.375   0.03535533906  -0.03535533906 ) // 23 A3 SE

    // Solid / water interface, r = 0.052 m
    (  0.375   0.03676955262   0.03676955262 ) // 24 B0 NE
    (  0.375  -0.03676955262   0.03676955262 ) // 25 B1 NW
    (  0.375  -0.03676955262  -0.03676955262 ) // 26 B2 SW
    (  0.375   0.03676955262  -0.03676955262 ) // 27 B3 SE

    // Outer water radius, r = 0.100 m
    (  0.375   0.07071067812   0.07071067812 ) // 28 D0 NE
    (  0.375  -0.07071067812   0.07071067812 ) // 29 D1 NW
    (  0.375  -0.07071067812  -0.07071067812 ) // 30 D2 SW
    (  0.375   0.07071067812  -0.07071067812 ) // 31 D3 SE
);


edges
(
    // -----------------------------------------------------------------
    // Circular arcs at x = -0.375 m
    // -----------------------------------------------------------------

    // r = 0.050 m
    arc 5 4  ( -0.375   0.000   0.050 )
    arc 7 4  ( -0.375   0.050   0.000 )
    arc 6 7  ( -0.375   0.000  -0.050 )
    arc 6 5  ( -0.375  -0.050   0.000 )

    // r = 0.052 m
    arc 9 8   ( -0.375   0.000   0.052 )
    arc 11 8  ( -0.375   0.052   0.000 )
    arc 10 11 ( -0.375   0.000  -0.052 )
    arc 10 9  ( -0.375  -0.052   0.000 )

    // r = 0.100 m
    arc 13 12 ( -0.375   0.000   0.100 )
    arc 15 12 ( -0.375   0.100   0.000 )
    arc 14 15 ( -0.375   0.000  -0.100 )
    arc 14 13 ( -0.375  -0.100   0.000 )


    // -----------------------------------------------------------------
    // Circular arcs at x = +0.375 m
    // -----------------------------------------------------------------

    // r = 0.050 m
    arc 21 20 (  0.375   0.000   0.050 )
    arc 23 20 (  0.375   0.050   0.000 )
    arc 22 23 (  0.375   0.000  -0.050 )
    arc 22 21 (  0.375  -0.050   0.000 )

    // r = 0.052 m
    arc 25 24 (  0.375   0.000   0.052 )
    arc 27 24 (  0.375   0.052   0.000 )
    arc 26 27 (  0.375   0.000  -0.052 )
    arc 26 25 (  0.375  -0.052   0.000 )

    // r = 0.100 m
    arc 29 28 (  0.375   0.000   0.100 )
    arc 31 28 (  0.375   0.100   0.000 )
    arc 30 31 (  0.375   0.000  -0.100 )
    arc 30 29 (  0.375  -0.100   0.000 )
);


blocks
(
    // -----------------------------------------------------------------
    // Oil: region1
    //
    // Central square: 24 x 24 cross-section
    // Four surrounding oil sectors: 12 cells radially
    // Axial direction: 150 cells over 0.75 m
    // -----------------------------------------------------------------

    hex (2 3 0 1 18 19 16 17)       (24 24 150) simpleGrading (1 1 1) // centre

    hex (1 0 4 5 17 16 20 21)       (24 12 150) simpleGrading (1 1 1) // top
    hex (3 7 4 0 19 23 20 16)       (12 24 150) simpleGrading (1 1 1) // right
    hex (6 7 3 2 22 23 19 18)       (24 12 150) simpleGrading (1 1 1) // bottom
    hex (6 2 1 5 22 18 17 21)       (12 24 150) simpleGrading (1 1 1) // left


    // -----------------------------------------------------------------
    // Solid pipe wall: pipeWall, 0.050 < r < 0.052 m
    // 6 cells through 2 mm wall thickness
    // -----------------------------------------------------------------

    hex (5 4 8 9 21 20 24 25)       (24 6 150)  simpleGrading (1 1 1) // top
    hex (7 11 8 4 23 27 24 20)      (6 24 150)  simpleGrading (1 1 1) // right
    hex (10 11 7 6 26 27 23 22)     (24 6 150)  simpleGrading (1 1 1) // bottom
    hex (10 6 5 9 26 22 21 25)      (6 24 150)  simpleGrading (1 1 1) // left


    // -----------------------------------------------------------------
    // Water annulus: region2, 0.052 < r < 0.100 m
    // 32 radial cells
    // -----------------------------------------------------------------

    hex (9 8 12 13 25 24 28 29)     (24 32 150) simpleGrading (1 1 1) // top
    hex (11 15 12 8 27 31 28 24)    (32 24 150) simpleGrading (1 1 1) // right
    hex (14 15 11 10 30 31 27 26)   (24 32 150) simpleGrading (1 1 1) // bottom
    hex (14 10 9 13 30 26 25 29)    (32 24 150) simpleGrading (1 1 1) // left
);


boundary
(
    // -----------------------------------------------------------------
    // Oil ends
    // x = -0.375: inlet1
    // x = +0.375: outlet1
    // -----------------------------------------------------------------

    inlet1
    {
        type patch;
        faces
        (
            (2 1 0 3)       // central square
            (1 5 4 0)       // top oil sector
            (3 0 4 7)       // right oil sector
            (6 2 3 7)       // bottom oil sector
            (6 5 1 2)       // left oil sector
        );
    }

    outlet1
    {
        type patch;
        faces
        (
            (18 19 16 17)   // central square
            (17 16 20 21)   // top oil sector
            (19 23 20 16)   // right oil sector
            (22 23 19 18)   // bottom oil sector
            (22 18 17 21)   // left oil sector
        );
    }


    // -----------------------------------------------------------------
    // Water ends
    // Patch names remain geometric names.
    // For counter-flow you can make outlet2 the PHYSICAL inlet using BCs.
    // -----------------------------------------------------------------

    inlet2
    {
        type patch;
        faces
        (
            (9 13 12 8)     // top water sector
            (11 8 12 15)    // right water sector
            (14 10 11 15)   // bottom water sector
            (14 13 9 10)    // left water sector
        );
    }

    outlet2
    {
        type patch;
        faces
        (
            (25 24 28 29)   // top water sector
            (27 31 28 24)   // right water sector
            (30 31 27 26)   // bottom water sector
            (30 26 25 29)   // left water sector
        );
    }


    // -----------------------------------------------------------------
    // Exposed axial ends of the solid separating wall
    // -----------------------------------------------------------------

    wallEnds
    {
        type wall;
        faces
        (
            // x = -0.375
            (5 9 8 4)
            (7 4 8 11)
            (10 6 7 11)
            (10 9 5 6)

            // x = +0.375
            (21 20 24 25)
            (23 27 24 20)
            (26 27 23 22)
            (26 22 21 25)
        );
    }


    // -----------------------------------------------------------------
    // Outer cylindrical wall of the water annulus, r = 0.100 m
    // -----------------------------------------------------------------

    outerWall
    {
        type wall;
        faces
        (
            (13 29 28 12)   // top
            (15 31 28 12)   // right
            (14 30 31 15)   // bottom
            (14 13 29 30)   // left
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
