OppositeDirectionFlow/constant/region1/thermophysicalProperties
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant/region1";
    object      thermophysicalProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

thermoType
{
    type            heRhoThermo;
    mixture         pureMixture;
    transport       const;
    thermo          hConst;
    equationOfState rhoConst;
    specie          specie;
    energy          sensibleEnthalpy;
}

mixture
{
    // Heat-transfer oil at approximately 400 K

    specie
    {
        molWeight       252;
    }

    equationOfState
    {
        rho             936;
    }

    thermodynamics
    {
        Cp              1931;
        Hf              0;
    }

    transport
    {
        mu              2.17e-3;
        Pr              37.5;
    }
}

// ************************************************************************* //
