OppositeDirectionFlow/0/region1/p
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0/region1";
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [ 1 -1 -2 0 0 0 0 ];

internalField   uniform 101325;

boundaryField
{
    inlet1
    {
        type            calculated;
        value           uniform 101325;
    }

    outlet1
    {
        type            calculated;
        value           uniform 101325;
    }

    region1_to_pipeWall
    {
        type            calculated;
        value           uniform 101325;
    }
}

// ************************************************************************* //
