OppositeDirectionFlow/0/region1/p_rgh
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0/region1";
    object      p_rgh;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [ 1 -1 -2 0 0 0 0 ];

internalField   uniform 0;

boundaryField
{
    #includeEtc "caseDicts/setConstraintTypes"

    inlet1
    {
        type            fixedFluxPressure;
        value           uniform 0;
    }

    outlet1
    {
        type            fixedValue;
        value           uniform 0;
    }

    region1_to_pipeWall
    {
        type            fixedFluxPressure;
        value           uniform 0;
    }
}

// ************************************************************************* //
