OppositeDirectionFlow/0/region2/omega
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0/region2";
    object      omega;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 -1 0 0 0 0];

internalField   uniform 32;

boundaryField
{
    outlet2
    {
        type            fixedValue;
        value           uniform 32;
    }

    inlet2
    {
        type            zeroGradient;
    }

    region2_to_pipeWall
    {
        type            omegaWallFunction;
        value           uniform 32;
    }

    outerWall
    {
        type            omegaWallFunction;
        value           uniform 32;
    }
}
// ************************************************************************* //
